app/views/conversations/new.html.erb

SELECT "users".* FROM "users"
---
    <div>
      <%= select_tag :user_id,options_from_collection_for_select(User.all,:id,:first_name) %>