app/controllers/comments_controller.rb

  def index

    @comments = Comment.where(tutor: @tutor)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."tutor_id" = 12 LIMIT 1

  def create
    @comment = Comment.new(comment_params)
    @comment.tutor=@tutor
    @comment.user=@user

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("tutor_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tutor_id", 11], ["user_id", 9], ["created_at", "2016-11-26 05:37:09.163318"], ["updated_at", "2016-11-26 05:37:09.163318"]]

  def find_tutor
    if params[:tutor_id]
      @tutor=Tutor.find(params[:tutor_id])
---
SELECT  "tutors".* FROM "tutors" WHERE "tutors"."id" = $1 LIMIT 1  [["id", 12]]