app/controllers/conversations_controller.rb

  def create
    @recipient=User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 9]]