app/controllers/tutors_controller.rb

  def index
    @tutors = Tutor.all
---
SELECT "tutors".* FROM "tutors"

  def show
    @hash = Gmaps4rails.build_markers(@tutor) do |user, marker|
      marker.lat user.latitude
      marker.lng user.longitude
    end

    @event=Event.new
    @comments=Comment.where(tutor:@tutor);
---
SELECT "comments".* FROM "comments" WHERE "comments"."tutor_id" = 12

  def create
    @tutor = Tutor.new(tutor_params)

    @user=current_user

    @tutor.user=@user



    point=Geocoder.coordinates(@tutor.address)
    @tutor.latitude=point[0]
    @tutor.longitude=point[1]


    respond_to do |format|
      if @tutor.save

        if user_sign_in?
        user=current_user
        user.is_tutor=true
        user.save
---
INSERT INTO "tutors" ("degree", "low_price", "high_price", "cellphone", "image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "users" SET "is_tutor" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["is_tutor", "t"], ["updated_at", "2016-11-17 07:45:42.077598"], ["id", 8]]

  def update
    respond_to do |format|
      if @tutor.update(tutor_params)
---
UPDATE "tutors" SET "high_price" = $1, "updated_at" = $2 WHERE "tutors"."id" = $3  [["high_price", 8854], ["updated_at", "2016-11-27 03:09:04.137808"], ["id", 11]]

  def destroy
    @tutor.destroy
---
DELETE FROM "tutors" WHERE "tutors"."id" = $1  [["id", 7]]

    def set_tutor
      @tutor = Tutor.find(params[:id]) if params[:id]
---
SELECT  "tutors".* FROM "tutors" WHERE "tutors"."id" = $1 LIMIT 1  [["id", 7]]